//==================================================
// 
// 3Dゲーム制作 ( light.cpp )
// Author  : katsuki mizuki
// 
//==================================================

//--------------------------------------------------
// インクルード
//--------------------------------------------------
#include "light.h"
#include "main.h"

//--------------------------------------------------
// スタティック変数
//--------------------------------------------------
static D3DLIGHT9		s_light;		// ライトの情報

//--------------------------------------------------
// 初期化
//--------------------------------------------------
void InitLight(void)
{
	// デバイスへのポインタの取得
	LPDIRECT3DDEVICE9 pDevice = GetDevice();

	D3DXVECTOR3 vecDir;		// ライトの方向ベクトル

	// ライトをクリアする
	ZeroMemory(&s_light, sizeof(D3DLIGHT9));

	// ライトの種類を設定 ( 平行光源 )
	s_light.Type = D3DLIGHT_DIRECTIONAL;

	// ライトの拡散光を設定 ( ライトの色 )
	s_light.Diffuse = D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f);

	// ライトの方向を設定
	vecDir = D3DXVECTOR3(0.2f, -0.8f, -0.4f);

	// 正規化する ( 大きさ 1 のベクトルにする )
	D3DXVec3Normalize(&vecDir, &vecDir);
	s_light.Direction = vecDir;

	// ライトを設定する
	pDevice->SetLight(0, &s_light);

	// ライトを有効にする
	pDevice->LightEnable(0, TRUE);
}

//--------------------------------------------------
// 終了
//--------------------------------------------------
void UninitLight(void)
{
	
}

//--------------------------------------------------
// 更新
//--------------------------------------------------
void UpdateLight(void)
{

}